# GetAppearance Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..GetAppearance Method
MaterialNode Class See Also
---
Appearance properties associated with the material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Asset GetAppearance()
```

Visual Basic
---
```text
Public Function GetAppearance As Asset
```

Visual C++
---
```text
public:
Asset^ GetAppearance()
```

# ### Return Value
An instance of a rendering material asset
# Remarks
Properties and attributes of the material's appearance can be accessed using the standard interface of the Asset class.
The structure of the properties, including their types and names is proprietary and as such it is not always useful to anyone who is not familiar with the particular schema. Also, the structure is not standardized and may change over time, therefore it is not recommended relaying on any appearance property to be present.
# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace